Revit 2022 API
StructuralSettings.AnalyticalModelDiscrepancyTolerance Property
 Tolerance for the analytical-to-physical model distance.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2011
Syntax
C#
public double AnalyticalModelDiscrepancyTolerance { get; set; }
Visual Basic
Public Property AnalyticalModelDiscrepancyTolerance As Double
	Get
	Set
Visual C++
public:
property double AnalyticalModelDiscrepancyTolerance {
	double get ();
	void set (double value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Structural.
See Also
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace